test/fixtures/charge_create.json

{
  "object": "charge",
  "id": "chrg_test_52p4rhprenluzvc944g",
  "livemode": false,
  "location": "/charges/chrg_test_52p4rhprenluzvc944g",
  "amount": 10000,
  "currency": "thb",
  "description": null,
  "status": "successful",
  "capture": true,
  "authorized": true,
  "paid": true,
  "transaction": "trxn_test_52p4rhst6ycli7rbxj6",
  "refunded": 0,
  "refunds": {
    "object": "list",
    "from": "1970-01-01T07:00:00+07:00",
    "to": "2016-01-15T22:04:07+07:00",
    "offset": 0,
    "limit": 20,
    "total": 0,
    "order": null,
    "location": "/charges/chrg_test_52p4rhprenluzvc944g/refunds",
    "data": [

    ]
  },
  "failure_code": null,
  "failure_message": null,
  "card": {
    "object": "card",
    "id": "card_test_52p4rdlcg6gbeagxz5s",
    "livemode": false,
    "country": "",
    "city": "Capital City",
    "postal_code": "10320",
    "financing": "",
    "bank": "",
    "last_digits": "4242",
    "brand": "Visa",
    "expiration_month": 10,
    "expiration_year": 2019,
    "fingerprint": "YFW3wgBgSCJB0726bXGBkx2HZOIx9vEWFk+BX0h75HI=",
    "name": "Edward Elric",
    "security_code_check": true,
    "created": "2016-01-15T15:03:48Z"
  },
  "customer": null,
  "ip": null,
  "dispute": null,
  "created": "2016-01-15T15:04:07Z"
}
