test/fixtures/charges_list.json

{
  "object": "list",
  "from": "1970-01-01T07:00:00+07:00",
  "to": "2016-01-15T21:58:44+07:00",
  "offset": 0,
  "limit": 2,
  "total": 73,
  "order": "chronological",
  "location": "/charges",
  "data": [
    {
      "object": "charge",
      "id": "chrg_test_52om9eldpnmetg4ald1",
      "livemode": false,
      "location": "/charges/chrg_test_52om9eldpnmetg4ald1",
      "amount": 100000,
      "currency": "thb",
      "description": null,
      "status": "successful",
      "capture": true,
      "authorized": true,
      "paid": true,
      "transaction": "trxn_test_52om9enzl8bqx3f2bf4",
      "refunded": 60000,
      "refunds": {
        "object": "list",
        "from": "1970-01-01T07:00:00+07:00",
        "to": "2016-01-15T21:58:44+07:00",
        "offset": 0,
        "limit": 20,
        "total": 2,
        "order": null,
        "location": "/charges/chrg_test_52om9eldpnmetg4ald1/refunds",
        "data": [
          {
            "object": "refund",
            "id": "rfnd_test_52om9epvrn96fc7m780",
            "location": "/charges/chrg_test_52om9eldpnmetg4ald1/refunds/rfnd_test_52om9epvrn96fc7m780",
            "amount": 10000,
            "currency": "thb",
            "charge": "chrg_test_52om9eldpnmetg4ald1",
            "transaction": "trxn_test_52om9eq4j6htr5lxp1q",
            "created": "2016-01-14T07:31:56Z"
          },
          {
            "object": "refund",
            "id": "rfnd_test_52om9et3j6kl7t7jq7r",
            "location": "/charges/chrg_test_52om9eldpnmetg4ald1/refunds/rfnd_test_52om9et3j6kl7t7jq7r",
            "amount": 50000,
            "currency": "thb",
            "charge": "chrg_test_52om9eldpnmetg4ald1",
            "transaction": "trxn_test_52om9etaof49hl74u32",
            "created": "2016-01-14T07:31:57Z"
          }
        ]
      },
      "failure_code": null,
      "failure_message": null,
      "card": {
        "object": "card",
        "id": "card_test_52om9ejyh8bx91pscmb",
        "livemode": false,
        "country": "us",
        "city": "Death Star",
        "postal_code": "10320",
        "financing": "",
        "bank": "",
        "last_digits": "4242",
        "brand": "Visa",
        "expiration_month": 10,
        "expiration_year": 2019,
        "fingerprint": "YFW3wgBgSCJB0726bXGBkx2HZOIx9vEWFk+BX0h75HI=",
        "name": "Kylo Ren",
        "security_code_check": true,
        "created": "2016-01-14T07:31:55Z"
      },
      "customer": null,
      "ip": null,
      "dispute": null,
      "created": "2016-01-14T07:31:56Z"
    },
    {
      "object": "charge",
      "id": "chrg_test_52om9facx5z98itiwsa",
      "livemode": false,
      "location": "/charges/chrg_test_52om9facx5z98itiwsa",
      "amount": 10000,
      "currency": "thb",
      "description": null,
      "status": "successful",
      "capture": false,
      "authorized": true,
      "paid": true,
      "transaction": "trxn_test_52om9fd2av3q4nszrlw",
      "refunded": 0,
      "refunds": {
        "object": "list",
        "from": "1970-01-01T07:00:00+07:00",
        "to": "2016-01-15T21:58:44+07:00",
        "offset": 0,
        "limit": 20,
        "total": 0,
        "order": null,
        "location": "/charges/chrg_test_52om9facx5z98itiwsa/refunds",
        "data": [

        ]
      },
      "failure_code": null,
      "failure_message": null,
      "card": {
        "object": "card",
        "id": "card_test_52om9f8odfjr62o9amj",
        "livemode": false,
        "location": "/customers/cust_test_52om9f9dm09vfxdarom/cards/card_test_52om9f8odfjr62o9amj",
        "country": "us",
        "city": "District 12",
        "postal_code": "10320",
        "financing": "",
        "bank": "",
        "last_digits": "4242",
        "brand": "Visa",
        "expiration_month": 10,
        "expiration_year": 2019,
        "fingerprint": "YFW3wgBgSCJB0726bXGBkx2HZOIx9vEWFk+BX0h75HI=",
        "name": "Katnis Everdeen",
        "security_code_check": true,
        "created": "2016-01-14T07:31:59Z"
      },
      "customer": "cust_test_52om9f9dm09vfxdarom",
      "ip": null,
      "dispute": null,
      "created": "2016-01-14T07:31:59Z"
    }
  ]
}
